{
  "backend/main.mo": "Main Motoko actor implementing the FlightLog backend with user profile management, per-user category CRUD (students, instructors, aircraft, exercises), and flight log entry storage with filtering and sorting, all protected by role-based access control.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (authentication, list manager UI, flight log entry form, flight records view) to their source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of every frontend source file, serving as a reference index for the frontend codebase structure.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH CSS custom properties for light and dark theme color tokens used by shadcn-ui components throughout the app.",
  "frontend/index.html": "Minimal HTML entry point titled 'FlightLog' that mounts the React app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with 7 routes, an AppLayout shell with Header/Footer, authentication gate showing LoginScreen for unauthenticated users, and a ProfileSetupModal for first-time users.",
  "frontend/src/components/FlightRecordsTable.tsx": "Scrollable table component that renders all 11 flight entry columns with alternating row styles and status badges for flight type (Solo/Dual) and landing type (Day/Night).",
  "frontend/src/components/Header.tsx": "Sticky navigation header showing the app logo, current page title, user profile info, and a logout button, with a responsive mobile hamburger menu.",
  "frontend/src/components/ListManager.tsx": "Reusable CRUD component for managing named category lists, supporting add, inline edit (delete+re-add), and delete operations with toast notifications.",
  "frontend/src/components/LoginScreen.tsx": "Full-screen login page with a background image, branding, feature highlights, and an Internet Identity login button.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts a newly authenticated user to enter their name and save a pilot profile before proceeding.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an authenticated (or anonymous) ICP backend actor via React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Hook that fetches the currently authenticated user's profile from the backend actor using React Query, gating the request until the actor is ready.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook that manage Internet Identity authentication state, exposing login/logout functions, identity, and status flags via an AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profile, categories (list/add/delete), and flight entries (get/add) using a shared actor from useActor.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind, imports Inter and Rajdhani fonts, and defines an aviation-themed dark navy design system with custom CSS variables and component utility classes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AircraftPage.tsx": "Page for managing the aircraft fleet, rendering a ListManager component with categoryType 'aircraft' and a back-navigation button.",
  "frontend/src/pages/ExercisesPage.tsx": "Page for managing training exercises, rendering a ListManager component with categoryType 'exercise' and a back-navigation button.",
  "frontend/src/pages/FlightLogEntryPage.tsx": "Form page for creating a new flight log entry, with fields for date, student, instructor, aircraft, exercise, flight type, times, and landing details, using useAddFlightEntry to persist data.",
  "frontend/src/pages/FlightRecordsPage.tsx": "Page that displays all flight records in a table with optional filtering by month and student name, using useGetFlightEntries and a FlightRecordsTable component.",
  "frontend/src/pages/InstructorsPage.tsx": "Page for managing the instructor roster, rendering a ListManager component with categoryType 'instructor' and a back-navigation button.",
  "frontend/src/pages/MainMenuPage.tsx": "Dashboard home page showing a welcome banner with total and today's flight counts, and a navigation grid linking to all major sections of the app.",
  "frontend/src/pages/StudentsPage.tsx": "Page for managing the student roster, rendering a ListManager component with categoryType 'student' and a back-navigation button.",
  "frontend/src/utils/timeCalculations.ts": "Provides utility functions for flight time calculations: computing flight duration from HH:MM takeoff/landing times (handling midnight crossover), converting date strings to epoch nanoseconds as BigInt, and formatting today's date as YYYY-MM-DD.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback for cross-navigation persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom fonts (Rajdhani, Inter), an extended OKLCH-based color palette (navy, sky, and semantic tokens), and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the overall project state for a flight log web/Android app rebuilt from Kivy/Python, listing implemented features (authentication, list management, flight entry form, flight records view) and architectural notes about data scoping and field definitions."
}