{
  "backend/main.mo": "Main Motoko actor for the FlightLog app that manages user profiles, category lists (students, instructors, aircraft, exercises), and flight log entries with CRUD operations, access control enforcement, and summary/reporting queries.",
  "feature_evidence.json": "Feature evidence report linking two bug-fix features (edit/update and delete for flight log entries) to their relevant frontend files, components, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "Auto-generated text file containing short summaries of each frontend source file, describing their purpose, key changes, and relationships within the FlightLog app.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH CSS custom properties for light and dark theme color tokens used by shadcn-ui components throughout the app.",
  "frontend/index.html": "Minimal HTML entry point for the Vite/React app, mounting the React root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with 8 routes, wraps the app in QueryClient/ThemeProvider/Toaster, handles authentication gating, and shows a ProfileSetupModal for first-time users.",
  "frontend/src/components/EditFlightEntryModal.tsx": "Modal dialog for editing an existing flight log entry, pre-populating form fields from the selected entry, validating input, and submitting the update via the useEditFlightEntry mutation while preserving the original dateEpoch as the storage key.",
  "frontend/src/components/FlightRecordsTable.tsx": "Renders a paginated table of flight log entries with edit and delete actions, using a confirmation dialog for deletions and an edit modal for updates.",
  "frontend/src/components/Header.tsx": "Sticky app header with logo, current page title, desktop/mobile navigation links, user profile display, and logout functionality via Internet Identity.",
  "frontend/src/components/ListManager.tsx": "Generic CRUD UI component for managing named category lists (e.g. students, aircraft), supporting add, inline edit, and delete with confirmation dialogs.",
  "frontend/src/components/LoginScreen.tsx": "Full-screen login page with a background image, feature highlights, and an Internet Identity sign-in button.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog shown to newly authenticated users to enter and save their pilot profile name before accessing the app.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an authenticated or anonymous ICP backend actor, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "React Query hook that fetches the currently authenticated user's profile from the backend actor, waiting until the actor is ready.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing login/logout state and persisting identity across page reloads using DFINITY's AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for all backend interactions including user profiles, categories, flight entries, and aircraft hours, with cache invalidation on mutations.",
  "frontend/src/index.css": "Global stylesheet defining an aviation-themed dark navy design system using Tailwind CSS, custom CSS variables, component classes, and utility animations.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AircraftPage.tsx": "Page for managing the aircraft fleet, displaying total flight hours per aircraft and a list manager for adding/removing aircraft entries.",
  "frontend/src/pages/ExercisesPage.tsx": "Page for managing training exercises, providing a ListManager component to add or remove exercises used in flight log entries.",
  "frontend/src/pages/FlightLogEntryPage.tsx": "Form page for creating a new flight log entry, collecting fields like date, student, instructor, aircraft, exercise, and flight times, then saving via the addFlightEntry mutation.",
  "frontend/src/pages/FlightRecordsPage.tsx": "Displays a filterable, paginated table of all flight entries with month and student name filters, and supports exporting the filtered results to an Excel file.",
  "frontend/src/pages/InstructorsPage.tsx": "Page for managing the instructor roster, wrapping the ListManager component configured for the 'instructor' category type.",
  "frontend/src/pages/MainMenuPage.tsx": "Dashboard home page showing a welcome banner, today's and current month's flight hour stats, and a navigation tile grid linking to all major app sections.",
  "frontend/src/pages/StudentReportPage.tsx": "Displays a ranked table of students sorted by total flight hours, including a grand total footer, with loading and empty states.",
  "frontend/src/pages/StudentsPage.tsx": "Page for managing the student roster, wrapping the ListManager component configured for the 'student' category type.",
  "frontend/src/utils/excelExport.ts": "Generates and downloads a valid .xlsx file from flight entry data by manually constructing the ZIP-based Open XML format without external dependencies.",
  "frontend/src/utils/timeCalculations.ts": "Utility functions for flight time arithmetic, including calculating duration between HH:MM times (with midnight crossing), converting date strings to BigInt nanosecond epochs, and formatting decimal hours as H:MM.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color palettes (navy, sky, and semantic tokens), custom fonts, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata for the FlightLog app, tracking two existing fix features (edit/update and delete mutations for flight log entries) and one pending backend audit task for Motoko actor functions."
}