{
  "kind": "build_request",
  "title": "Fix flight record update, edit, and delete operations",
  "projectName": "FlightLog",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the backend updateFlightEntry function in the Motoko actor so that edits to an existing flight log entry are correctly persisted and returned without error.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Flight record please update and change and delete not working please work"
        ]
      },
      "acceptanceCriteria": [
        "Calling updateFlightEntry with valid parameters updates the stored entry and returns the updated record.",
        "No error or null is returned when a valid flight entry ID and updated fields are provided.",
        "Updated values are reflected in subsequent getFlightEntries calls."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix the deleteFlightEntry backend function so that a flight log entry is correctly removed from storage when the delete action is triggered.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Flight record please update and change and delete not working please work"
        ]
      },
      "acceptanceCriteria": [
        "Calling deleteFlightEntry with a valid entry ID removes the entry from the store.",
        "The deleted entry no longer appears in subsequent getFlightEntries calls.",
        "Attempting to delete a non-existent entry returns an appropriate error variant without crashing."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Fix the useEditFlightEntry mutation hook in the frontend so that submitting the EditFlightEntryModal correctly calls the backend updateFlightEntry function, serializes all field values properly, and invalidates the flight entries query cache on success.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Flight record please update and change and delete not working please work"
        ]
      },
      "acceptanceCriteria": [
        "Submitting the edit modal sends all updated field values to the backend without serialization errors.",
        "On successful update, the flight records table reflects the new values without requiring a page reload.",
        "A success toast notification is displayed after a successful update.",
        "An error toast is displayed if the update fails."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Fix the delete mutation hook and confirmation dialog in FlightRecordsTable so that confirming deletion correctly calls the backend deleteFlightEntry function and removes the entry from the displayed table.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Flight record please update and change and delete not working please work"
        ]
      },
      "acceptanceCriteria": [
        "Clicking the delete action and confirming in the alert dialog triggers the deleteFlightEntry backend call.",
        "The deleted row is removed from the table immediately after a successful delete.",
        "A success toast notification is displayed after a successful delete.",
        "An error toast is displayed if the delete fails."
      ]
    }
  ],
  "constraints": [
    "Do not change the flight entry data model or schema.",
    "Do not alter immutable frontend paths (hooks/useInternetIdentity.ts, hooks/useActor.ts, main.tsx, components/ui)."
  ],
  "nonGoals": [
    "Adding new flight entry fields or changing the form layout.",
    "Modifying any other CRUD operations unrelated to flight entries.",
    "Changing authentication or authorization logic."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}