{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix flight record update, edit, and delete operations",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Fix the useEditFlightEntry mutation hook so that submitting the EditFlightEntryModal correctly calls the backend updateFlightEntry function, serializes all field values properly, and invalidates the flight entries query cache on success",
      "acceptanceCriteria": [
        "Submitting the edit modal sends all updated field values to the backend without serialization errors.",
        "On successful update, the flight records table reflects the new values without requiring a page reload.",
        "A success toast notification is displayed after a successful update.",
        "An error toast is displayed if the update fails."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Fix the useEditFlightEntry mutation hook to ensure all FlightEntry field values (including dateEpoch BigInt, totalFlightTime string, and enum variants for flightType and landingType) are correctly serialized when calling actor.updateFlightEntry. Ensure the mutation invalidates the ['flightEntries'] query cache on success and displays appropriate toast notifications for success and error states. Verify that the entryId is passed as BigInt and that all time/date fields match the backend interface type requirements."
        },
        {
          "path": "frontend/src/components/EditFlightEntryModal.tsx",
          "operation": "modify",
          "description": "Review and fix the form submission handler to ensure all field values are correctly extracted from the form state and passed to the useEditFlightEntry mutation. Verify that date strings are converted to dateEpoch BigInt using the timeCalculations utility, that totalFlightTime is calculated correctly, and that enum fields (flightType: 'dual' | 'solo', landingType: 'day' | 'night') are passed as the correct variant format expected by the backend. Ensure landingCount is converted to BigInt before submission."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Fix the delete mutation hook and confirmation dialog in FlightRecordsTable so that confirming deletion correctly calls the backend deleteFlightEntry function and removes the entry from the displayed table",
      "acceptanceCriteria": [
        "Clicking the delete action and confirming in the alert dialog triggers the deleteFlightEntry backend call.",
        "The deleted row is removed from the table immediately after a successful delete.",
        "A success toast notification is displayed after a successful delete.",
        "An error toast is displayed if the delete fails."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Fix the useDeleteFlightEntry mutation hook to correctly call actor.deleteFlightEntry with the entryId as BigInt. Ensure the mutation invalidates the ['flightEntries'] query cache on success to trigger a table refresh, and displays success and error toast notifications appropriately. Handle any errors returned from the backend gracefully."
        },
        {
          "path": "frontend/src/components/FlightRecordsTable.tsx",
          "operation": "modify",
          "description": "Review and fix the delete action handler to ensure the correct entryId is extracted from the selected flight entry row and passed as BigInt to the useDeleteFlightEntry mutation when the user confirms deletion in the alert dialog. Verify that the confirmation dialog is properly wired and that the mutation is triggered only after user confirmation. Ensure the table UI updates immediately after successful deletion via query invalidation."
        }
      ]
    }
  ]
}